loadtest/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]
time="2026-03-30T18:36:50Z" level=info msg="Login Response Status: 200" source=console
time="2026-03-30T18:36:50Z" level=info msg="Login Response Body: {\"refresh\":\"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ0b2tlbl90eXBlIjoicmVmcmVzaCIsImV4cCI6MTc3NTUwMDYxMCwiaWF0IjoxNzc0ODk1ODEwLCJqdGkiOiJlNTgyZjYzN2M1ZmY0MGI4YjFiOTk3NDk4NjdhYjhhMiIsInVzZXJfaWQiOiIxIn0.jsytlIHLVEC3mIPNmk018JWmviA7ft8G296fyZske_s\",\"access\":\"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ0b2tlbl90eXBlIjoiYWNjZXNzIiwiZXhwIjoxNzc0OTAzMDEwLCJpYXQiOjE3NzQ4OTU4MTAsImp0aSI6ImUyZjkzYTk4NWVjNTRmNzRhNjRkMmRkOGM4OTk0ZGI2IiwidXNlcl9pZCI6IjEifQ.Mai0zMwAmbr3JMidbnVz_IDM9CDnAF1R4NCN5f0qEl0\"}" source=console
time="2026-03-30T18:36:50Z" level=info msg="Login successful, token acquired." source=console

running (0m02.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/50 VUs  0m00.6s/4m00.0s

running (0m03.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m01.6s/4m00.0s

running (0m04.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m02.6s/4m00.0s

running (0m05.0s), 02/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m03.6s/4m00.0s

running (0m06.0s), 02/50 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m04.6s/4m00.0s

running (0m07.0s), 02/50 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m05.6s/4m00.0s

running (0m08.0s), 03/50 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 03/50 VUs  0m06.6s/4m00.0s

running (0m09.0s), 03/50 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 03/50 VUs  0m07.6s/4m00.0s

running (0m10.0s), 03/50 VUs, 11 complete and 0 interrupted iterations
default   [   4% ] 03/50 VUs  0m08.6s/4m00.0s

running (0m11.0s), 04/50 VUs, 14 complete and 0 interrupted iterations
default   [   4% ] 04/50 VUs  0m09.6s/4m00.0s

running (0m12.0s), 04/50 VUs, 17 complete and 0 interrupted iterations
default   [   4% ] 04/50 VUs  0m10.6s/4m00.0s

running (0m13.0s), 04/50 VUs, 20 complete and 0 interrupted iterations
default   [   5% ] 04/50 VUs  0m11.6s/4m00.0s

running (0m14.0s), 04/50 VUs, 23 complete and 0 interrupted iterations
default   [   5% ] 04/50 VUs  0m12.6s/4m00.0s

running (0m15.0s), 05/50 VUs, 27 complete and 0 interrupted iterations
default   [   6% ] 05/50 VUs  0m13.6s/4m00.0s

running (0m16.0s), 05/50 VUs, 31 complete and 0 interrupted iterations
default   [   6% ] 05/50 VUs  0m14.6s/4m00.0s

running (0m17.0s), 05/50 VUs, 35 complete and 0 interrupted iterations
default   [   6% ] 05/50 VUs  0m15.6s/4m00.0s

running (0m18.0s), 06/50 VUs, 40 complete and 0 interrupted iterations
default   [   7% ] 06/50 VUs  0m16.6s/4m00.0s

running (0m19.0s), 06/50 VUs, 45 complete and 0 interrupted iterations
default   [   7% ] 06/50 VUs  0m17.6s/4m00.0s

running (0m20.0s), 06/50 VUs, 49 complete and 0 interrupted iterations
default   [   8% ] 06/50 VUs  0m18.6s/4m00.0s

running (0m21.0s), 07/50 VUs, 55 complete and 0 interrupted iterations
default   [   8% ] 07/50 VUs  0m19.6s/4m00.0s

running (0m22.0s), 07/50 VUs, 60 complete and 0 interrupted iterations
default   [   9% ] 07/50 VUs  0m20.6s/4m00.0s

running (0m23.0s), 07/50 VUs, 66 complete and 0 interrupted iterations
default   [   9% ] 07/50 VUs  0m21.6s/4m00.0s

running (0m24.0s), 08/50 VUs, 71 complete and 0 interrupted iterations
default   [   9% ] 08/50 VUs  0m22.6s/4m00.0s

running (0m25.0s), 08/50 VUs, 77 complete and 0 interrupted iterations
default   [  10% ] 08/50 VUs  0m23.6s/4m00.0s

running (0m26.0s), 08/50 VUs, 83 complete and 0 interrupted iterations
default   [  10% ] 08/50 VUs  0m24.6s/4m00.0s

running (0m27.0s), 09/50 VUs, 88 complete and 0 interrupted iterations
default   [  11% ] 09/50 VUs  0m25.6s/4m00.0s

running (0m28.0s), 09/50 VUs, 94 complete and 0 interrupted iterations
default   [  11% ] 09/50 VUs  0m26.6s/4m00.0s

running (0m29.0s), 09/50 VUs, 99 complete and 0 interrupted iterations
default   [  11% ] 09/50 VUs  0m27.6s/4m00.0s

running (0m30.0s), 10/50 VUs, 105 complete and 0 interrupted iterations
default   [  12% ] 10/50 VUs  0m28.6s/4m00.0s

running (0m31.0s), 10/50 VUs, 111 complete and 0 interrupted iterations
default   [  12% ] 10/50 VUs  0m29.6s/4m00.0s

running (0m32.0s), 10/50 VUs, 116 complete and 0 interrupted iterations
default   [  13% ] 10/50 VUs  0m30.6s/4m00.0s

running (0m33.0s), 10/50 VUs, 122 complete and 0 interrupted iterations
default   [  13% ] 10/50 VUs  0m31.6s/4m00.0s

running (0m34.0s), 11/50 VUs, 127 complete and 0 interrupted iterations
default   [  14% ] 11/50 VUs  0m32.6s/4m00.0s

running (0m35.0s), 11/50 VUs, 133 complete and 0 interrupted iterations
default   [  14% ] 11/50 VUs  0m33.6s/4m00.0s

running (0m36.0s), 11/50 VUs, 139 complete and 0 interrupted iterations
default   [  14% ] 11/50 VUs  0m34.6s/4m00.0s

running (0m37.0s), 12/50 VUs, 145 complete and 0 interrupted iterations
default   [  15% ] 12/50 VUs  0m35.6s/4m00.0s

running (0m38.0s), 12/50 VUs, 151 complete and 0 interrupted iterations
default   [  15% ] 12/50 VUs  0m36.6s/4m00.0s

running (0m39.0s), 12/50 VUs, 156 complete and 0 interrupted iterations
default   [  16% ] 12/50 VUs  0m37.6s/4m00.0s

running (0m40.0s), 13/50 VUs, 162 complete and 0 interrupted iterations
default   [  16% ] 13/50 VUs  0m38.6s/4m00.0s

running (0m41.0s), 13/50 VUs, 168 complete and 0 interrupted iterations
default   [  16% ] 13/50 VUs  0m39.6s/4m00.0s

running (0m42.0s), 13/50 VUs, 174 complete and 0 interrupted iterations
default   [  17% ] 13/50 VUs  0m40.6s/4m00.0s

running (0m43.0s), 14/50 VUs, 180 complete and 0 interrupted iterations
default   [  17% ] 14/50 VUs  0m41.6s/4m00.0s

running (0m44.0s), 14/50 VUs, 185 complete and 0 interrupted iterations
default   [  18% ] 14/50 VUs  0m42.6s/4m00.0s

running (0m45.0s), 14/50 VUs, 191 complete and 0 interrupted iterations
default   [  18% ] 14/50 VUs  0m43.6s/4m00.0s

running (0m46.0s), 15/50 VUs, 197 complete and 0 interrupted iterations
default   [  19% ] 15/50 VUs  0m44.6s/4m00.0s

running (0m47.0s), 15/50 VUs, 202 complete and 0 interrupted iterations
default   [  19% ] 15/50 VUs  0m45.6s/4m00.0s

running (0m48.0s), 15/50 VUs, 208 complete and 0 interrupted iterations
default   [  19% ] 15/50 VUs  0m46.6s/4m00.0s

running (0m49.0s), 16/50 VUs, 214 complete and 0 interrupted iterations
default   [  20% ] 16/50 VUs  0m47.6s/4m00.0s

running (0m50.0s), 16/50 VUs, 220 complete and 0 interrupted iterations
default   [  20% ] 16/50 VUs  0m48.6s/4m00.0s

running (0m51.0s), 16/50 VUs, 225 complete and 0 interrupted iterations
default   [  21% ] 16/50 VUs  0m49.6s/4m00.0s

running (0m52.0s), 17/50 VUs, 231 complete and 0 interrupted iterations
default   [  21% ] 17/50 VUs  0m50.6s/4m00.0s

running (0m53.0s), 17/50 VUs, 240 complete and 0 interrupted iterations
default   [  21% ] 17/50 VUs  0m51.6s/4m00.0s

running (0m54.0s), 17/50 VUs, 251 complete and 0 interrupted iterations
default   [  22% ] 17/50 VUs  0m52.6s/4m00.0s

running (0m55.0s), 17/50 VUs, 263 complete and 0 interrupted iterations
default   [  22% ] 17/50 VUs  0m53.6s/4m00.0s

running (0m56.0s), 18/50 VUs, 274 complete and 0 interrupted iterations
default   [  23% ] 18/50 VUs  0m54.6s/4m00.0s

running (0m57.0s), 18/50 VUs, 286 complete and 0 interrupted iterations
default   [  23% ] 18/50 VUs  0m55.6s/4m00.0s

running (0m58.0s), 18/50 VUs, 297 complete and 0 interrupted iterations
default   [  24% ] 18/50 VUs  0m56.6s/4m00.0s

running (0m59.0s), 19/50 VUs, 309 complete and 0 interrupted iterations
default   [  24% ] 19/50 VUs  0m57.6s/4m00.0s

running (1m00.0s), 19/50 VUs, 320 complete and 0 interrupted iterations
default   [  24% ] 19/50 VUs  0m58.6s/4m00.0s

running (1m01.0s), 19/50 VUs, 331 complete and 0 interrupted iterations
default   [  25% ] 19/50 VUs  0m59.6s/4m00.0s

running (1m02.0s), 20/50 VUs, 343 complete and 0 interrupted iterations
default   [  25% ] 20/50 VUs  1m00.6s/4m00.0s

running (1m03.0s), 20/50 VUs, 354 complete and 0 interrupted iterations
default   [  26% ] 20/50 VUs  1m01.6s/4m00.0s

running (1m04.0s), 20/50 VUs, 366 complete and 0 interrupted iterations
default   [  26% ] 20/50 VUs  1m02.6s/4m00.0s

running (1m05.0s), 20/50 VUs, 377 complete and 0 interrupted iterations
default   [  26% ] 20/50 VUs  1m03.6s/4m00.0s

running (1m06.0s), 21/50 VUs, 389 complete and 0 interrupted iterations
default   [  27% ] 21/50 VUs  1m04.6s/4m00.0s

running (1m07.0s), 21/50 VUs, 400 complete and 0 interrupted iterations
default   [  27% ] 21/50 VUs  1m05.6s/4m00.0s

running (1m08.0s), 21/50 VUs, 412 complete and 0 interrupted iterations
default   [  28% ] 21/50 VUs  1m06.6s/4m00.0s

running (1m09.0s), 21/50 VUs, 423 complete and 0 interrupted iterations
default   [  28% ] 21/50 VUs  1m07.6s/4m00.0s

running (1m10.0s), 22/50 VUs, 435 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  1m08.6s/4m00.0s

running (1m11.0s), 22/50 VUs, 446 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  1m09.6s/4m00.0s

running (1m12.0s), 22/50 VUs, 458 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  1m10.6s/4m00.0s

running (1m13.0s), 22/50 VUs, 469 complete and 0 interrupted iterations
default   [  30% ] 22/50 VUs  1m11.6s/4m00.0s

running (1m14.0s), 23/50 VUs, 480 complete and 0 interrupted iterations
default   [  30% ] 23/50 VUs  1m12.6s/4m00.0s

running (1m15.0s), 23/50 VUs, 492 complete and 0 interrupted iterations
default   [  31% ] 23/50 VUs  1m13.6s/4m00.0s

running (1m16.0s), 23/50 VUs, 504 complete and 0 interrupted iterations
default   [  31% ] 23/50 VUs  1m14.6s/4m00.0s

running (1m17.0s), 23/50 VUs, 514 complete and 0 interrupted iterations
default   [  31% ] 23/50 VUs  1m15.6s/4m00.0s

running (1m18.0s), 24/50 VUs, 526 complete and 0 interrupted iterations
default   [  32% ] 24/50 VUs  1m16.6s/4m00.0s

running (1m19.0s), 24/50 VUs, 538 complete and 0 interrupted iterations
default   [  32% ] 24/50 VUs  1m17.6s/4m00.0s

running (1m20.0s), 24/50 VUs, 550 complete and 0 interrupted iterations
default   [  33% ] 24/50 VUs  1m18.6s/4m00.0s

running (1m21.0s), 24/50 VUs, 560 complete and 0 interrupted iterations
default   [  33% ] 24/50 VUs  1m19.6s/4m00.0s
time="2026-03-30T18:38:10Z" level=warning msg="Request Failed" error="Post \"https://photoalbum-backend-photoalbum-f041om.apps.okd.fured.cloud.bme.hu/api/photos/\": EOF"
time="2026-03-30T18:38:10Z" level=info msg="Upload Failed! Status: 0 Body: null" source=console

running (1m22.0s), 25/50 VUs, 572 complete and 0 interrupted iterations
default   [  34% ] 25/50 VUs  1m20.6s/4m00.0s

running (1m23.0s), 25/50 VUs, 584 complete and 0 interrupted iterations
default   [  34% ] 25/50 VUs  1m21.6s/4m00.0s

running (1m24.0s), 25/50 VUs, 596 complete and 0 interrupted iterations
default   [  34% ] 25/50 VUs  1m22.6s/4m00.0s

running (1m25.0s), 25/50 VUs, 608 complete and 0 interrupted iterations
default   [  35% ] 25/50 VUs  1m23.6s/4m00.0s

running (1m26.0s), 26/50 VUs, 619 complete and 0 interrupted iterations
default   [  35% ] 26/50 VUs  1m24.6s/4m00.0s

running (1m27.0s), 26/50 VUs, 630 complete and 0 interrupted iterations
default   [  36% ] 26/50 VUs  1m25.6s/4m00.0s

running (1m28.0s), 26/50 VUs, 642 complete and 0 interrupted iterations
default   [  36% ] 26/50 VUs  1m26.6s/4m00.0s

running (1m29.0s), 26/50 VUs, 654 complete and 0 interrupted iterations
default   [  36% ] 26/50 VUs  1m27.6s/4m00.0s

running (1m30.0s), 27/50 VUs, 665 complete and 0 interrupted iterations
default   [  37% ] 27/50 VUs  1m28.6s/4m00.0s

running (1m31.0s), 27/50 VUs, 677 complete and 0 interrupted iterations
default   [  37% ] 27/50 VUs  1m29.6s/4m00.0s

running (1m32.0s), 27/50 VUs, 688 complete and 0 interrupted iterations
default   [  38% ] 27/50 VUs  1m30.6s/4m00.0s

running (1m33.0s), 27/50 VUs, 699 complete and 0 interrupted iterations
default   [  38% ] 27/50 VUs  1m31.6s/4m00.0s

running (1m34.0s), 28/50 VUs, 711 complete and 0 interrupted iterations
default   [  39% ] 28/50 VUs  1m32.6s/4m00.0s

running (1m35.0s), 28/50 VUs, 723 complete and 0 interrupted iterations
default   [  39% ] 28/50 VUs  1m33.6s/4m00.0s

running (1m36.0s), 28/50 VUs, 735 complete and 0 interrupted iterations
default   [  39% ] 28/50 VUs  1m34.6s/4m00.0s

running (1m37.0s), 28/50 VUs, 746 complete and 0 interrupted iterations
default   [  40% ] 28/50 VUs  1m35.6s/4m00.0s

running (1m38.0s), 29/50 VUs, 757 complete and 0 interrupted iterations
default   [  40% ] 29/50 VUs  1m36.6s/4m00.0s

running (1m39.0s), 29/50 VUs, 769 complete and 0 interrupted iterations
default   [  41% ] 29/50 VUs  1m37.6s/4m00.0s

running (1m40.0s), 29/50 VUs, 781 complete and 0 interrupted iterations
default   [  41% ] 29/50 VUs  1m38.6s/4m00.0s

running (1m41.0s), 29/50 VUs, 793 complete and 0 interrupted iterations
default   [  41% ] 29/50 VUs  1m39.6s/4m00.0s

running (1m42.0s), 30/50 VUs, 803 complete and 0 interrupted iterations
default   [  42% ] 30/50 VUs  1m40.6s/4m00.0s

running (1m43.0s), 30/50 VUs, 815 complete and 0 interrupted iterations
default   [  42% ] 30/50 VUs  1m41.6s/4m00.0s

running (1m44.0s), 30/50 VUs, 827 complete and 0 interrupted iterations
default   [  43% ] 30/50 VUs  1m42.6s/4m00.0s

running (1m45.0s), 30/50 VUs, 837 complete and 0 interrupted iterations
default   [  43% ] 30/50 VUs  1m43.6s/4m00.0s

running (1m46.0s), 31/50 VUs, 849 complete and 0 interrupted iterations
default   [  44% ] 31/50 VUs  1m44.6s/4m00.0s

running (1m47.0s), 31/50 VUs, 860 complete and 0 interrupted iterations
default   [  44% ] 31/50 VUs  1m45.6s/4m00.0s

running (1m48.0s), 31/50 VUs, 872 complete and 0 interrupted iterations
default   [  44% ] 31/50 VUs  1m46.6s/4m00.0s

running (1m49.0s), 31/50 VUs, 883 complete and 0 interrupted iterations
default   [  45% ] 31/50 VUs  1m47.6s/4m00.0s

running (1m50.0s), 32/50 VUs, 897 complete and 0 interrupted iterations
default   [  45% ] 32/50 VUs  1m48.6s/4m00.0s

running (1m51.0s), 32/50 VUs, 913 complete and 0 interrupted iterations
default   [  46% ] 32/50 VUs  1m49.6s/4m00.0s

running (1m52.0s), 32/50 VUs, 930 complete and 0 interrupted iterations
default   [  46% ] 32/50 VUs  1m50.6s/4m00.0s

running (1m53.0s), 32/50 VUs, 948 complete and 0 interrupted iterations
default   [  46% ] 32/50 VUs  1m51.6s/4m00.0s

running (1m54.0s), 33/50 VUs, 965 complete and 0 interrupted iterations
default   [  47% ] 33/50 VUs  1m52.6s/4m00.0s

running (1m55.0s), 33/50 VUs, 983 complete and 0 interrupted iterations
default   [  47% ] 33/50 VUs  1m53.6s/4m00.0s

running (1m56.0s), 33/50 VUs, 1001 complete and 0 interrupted iterations
default   [  48% ] 33/50 VUs  1m54.6s/4m00.0s

running (1m57.0s), 33/50 VUs, 1018 complete and 0 interrupted iterations
default   [  48% ] 33/50 VUs  1m55.6s/4m00.0s

running (1m58.0s), 34/50 VUs, 1036 complete and 0 interrupted iterations
default   [  49% ] 34/50 VUs  1m56.6s/4m00.0s

running (1m59.0s), 34/50 VUs, 1053 complete and 0 interrupted iterations
default   [  49% ] 34/50 VUs  1m57.6s/4m00.0s

running (2m00.0s), 34/50 VUs, 1071 complete and 0 interrupted iterations
default   [  49% ] 34/50 VUs  1m58.6s/4m00.0s

running (2m01.0s), 34/50 VUs, 1088 complete and 0 interrupted iterations
default   [  50% ] 34/50 VUs  1m59.6s/4m00.0s

running (2m02.0s), 35/50 VUs, 1105 complete and 0 interrupted iterations
default   [  50% ] 35/50 VUs  2m00.6s/4m00.0s

running (2m03.0s), 35/50 VUs, 1123 complete and 0 interrupted iterations
default   [  51% ] 35/50 VUs  2m01.6s/4m00.0s

running (2m04.0s), 35/50 VUs, 1140 complete and 0 interrupted iterations
default   [  51% ] 35/50 VUs  2m02.6s/4m00.0s

running (2m05.0s), 35/50 VUs, 1158 complete and 0 interrupted iterations
default   [  51% ] 35/50 VUs  2m03.6s/4m00.0s

running (2m06.0s), 36/50 VUs, 1175 complete and 0 interrupted iterations
default   [  52% ] 36/50 VUs  2m04.6s/4m00.0s

running (2m07.0s), 36/50 VUs, 1192 complete and 0 interrupted iterations
default   [  52% ] 36/50 VUs  2m05.6s/4m00.0s

running (2m08.0s), 36/50 VUs, 1210 complete and 0 interrupted iterations
default   [  53% ] 36/50 VUs  2m06.6s/4m00.0s

running (2m09.0s), 36/50 VUs, 1227 complete and 0 interrupted iterations
default   [  53% ] 36/50 VUs  2m07.6s/4m00.0s

running (2m10.0s), 37/50 VUs, 1244 complete and 0 interrupted iterations
default   [  54% ] 37/50 VUs  2m08.6s/4m00.0s

running (2m11.0s), 37/50 VUs, 1261 complete and 0 interrupted iterations
default   [  54% ] 37/50 VUs  2m09.6s/4m00.0s

running (2m12.0s), 37/50 VUs, 1278 complete and 0 interrupted iterations
default   [  54% ] 37/50 VUs  2m10.6s/4m00.0s

running (2m13.0s), 37/50 VUs, 1295 complete and 0 interrupted iterations
default   [  55% ] 37/50 VUs  2m11.6s/4m00.0s

running (2m14.0s), 38/50 VUs, 1313 complete and 0 interrupted iterations
default   [  55% ] 38/50 VUs  2m12.6s/4m00.0s

running (2m15.0s), 38/50 VUs, 1328 complete and 0 interrupted iterations
default   [  56% ] 38/50 VUs  2m13.6s/4m00.0s

running (2m16.0s), 38/50 VUs, 1346 complete and 0 interrupted iterations
default   [  56% ] 38/50 VUs  2m14.6s/4m00.0s

running (2m17.0s), 38/50 VUs, 1364 complete and 0 interrupted iterations
default   [  56% ] 38/50 VUs  2m15.6s/4m00.0s

running (2m18.0s), 39/50 VUs, 1380 complete and 0 interrupted iterations
default   [  57% ] 39/50 VUs  2m16.6s/4m00.0s

running (2m19.0s), 39/50 VUs, 1398 complete and 0 interrupted iterations
default   [  57% ] 39/50 VUs  2m17.6s/4m00.0s

running (2m20.0s), 39/50 VUs, 1415 complete and 0 interrupted iterations
default   [  58% ] 39/50 VUs  2m18.6s/4m00.0s

running (2m21.0s), 39/50 VUs, 1433 complete and 0 interrupted iterations
default   [  58% ] 39/50 VUs  2m19.6s/4m00.0s

running (2m22.0s), 40/50 VUs, 1446 complete and 0 interrupted iterations
default   [  59% ] 40/50 VUs  2m20.6s/4m00.0s

running (2m23.0s), 40/50 VUs, 1464 complete and 0 interrupted iterations
default   [  59% ] 40/50 VUs  2m21.6s/4m00.0s

running (2m24.0s), 40/50 VUs, 1482 complete and 0 interrupted iterations
default   [  59% ] 40/50 VUs  2m22.6s/4m00.0s

running (2m25.0s), 40/50 VUs, 1498 complete and 0 interrupted iterations
default   [  60% ] 40/50 VUs  2m23.6s/4m00.0s

running (2m26.0s), 41/50 VUs, 1516 complete and 0 interrupted iterations
default   [  60% ] 41/50 VUs  2m24.6s/4m00.0s

running (2m27.0s), 41/50 VUs, 1533 complete and 0 interrupted iterations
default   [  61% ] 41/50 VUs  2m25.6s/4m00.0s

running (2m28.0s), 41/50 VUs, 1550 complete and 0 interrupted iterations
default   [  61% ] 41/50 VUs  2m26.6s/4m00.0s

running (2m29.0s), 41/50 VUs, 1573 complete and 0 interrupted iterations
default   [  61% ] 41/50 VUs  2m27.6s/4m00.0s

running (2m30.0s), 42/50 VUs, 1597 complete and 0 interrupted iterations
default   [  62% ] 42/50 VUs  2m28.6s/4m00.0s

running (2m31.0s), 42/50 VUs, 1621 complete and 0 interrupted iterations
default   [  62% ] 42/50 VUs  2m29.6s/4m00.0s

running (2m32.0s), 42/50 VUs, 1647 complete and 0 interrupted iterations
default   [  63% ] 42/50 VUs  2m30.6s/4m00.0s

running (2m33.0s), 42/50 VUs, 1673 complete and 0 interrupted iterations
default   [  63% ] 42/50 VUs  2m31.6s/4m00.0s

running (2m34.0s), 43/50 VUs, 1703 complete and 0 interrupted iterations
default   [  64% ] 43/50 VUs  2m32.6s/4m00.0s

running (2m35.0s), 43/50 VUs, 1733 complete and 0 interrupted iterations
default   [  64% ] 43/50 VUs  2m33.6s/4m00.0s

running (2m36.0s), 43/50 VUs, 1761 complete and 0 interrupted iterations
default   [  64% ] 43/50 VUs  2m34.6s/4m00.0s

running (2m37.0s), 43/50 VUs, 1788 complete and 0 interrupted iterations
default   [  65% ] 43/50 VUs  2m35.6s/4m00.0s

running (2m38.0s), 44/50 VUs, 1816 complete and 0 interrupted iterations
default   [  65% ] 44/50 VUs  2m36.6s/4m00.0s

running (2m39.0s), 44/50 VUs, 1845 complete and 0 interrupted iterations
default   [  66% ] 44/50 VUs  2m37.6s/4m00.0s

running (2m40.0s), 44/50 VUs, 1872 complete and 0 interrupted iterations
default   [  66% ] 44/50 VUs  2m38.6s/4m00.0s

running (2m41.0s), 44/50 VUs, 1902 complete and 0 interrupted iterations
default   [  66% ] 44/50 VUs  2m39.6s/4m00.0s

running (2m42.0s), 45/50 VUs, 1932 complete and 0 interrupted iterations
default   [  67% ] 45/50 VUs  2m40.6s/4m00.0s

running (2m43.0s), 45/50 VUs, 1962 complete and 0 interrupted iterations
default   [  67% ] 45/50 VUs  2m41.6s/4m00.0s

running (2m44.0s), 45/50 VUs, 1988 complete and 0 interrupted iterations
default   [  68% ] 45/50 VUs  2m42.6s/4m00.0s

running (2m45.0s), 45/50 VUs, 2018 complete and 0 interrupted iterations
default   [  68% ] 45/50 VUs  2m43.6s/4m00.0s

running (2m46.0s), 46/50 VUs, 2046 complete and 0 interrupted iterations
default   [  69% ] 46/50 VUs  2m44.6s/4m00.0s

running (2m47.0s), 46/50 VUs, 2076 complete and 0 interrupted iterations
default   [  69% ] 46/50 VUs  2m45.6s/4m00.0s

running (2m48.0s), 46/50 VUs, 2103 complete and 0 interrupted iterations
default   [  69% ] 46/50 VUs  2m46.6s/4m00.0s

running (2m49.0s), 46/50 VUs, 2133 complete and 0 interrupted iterations
default   [  70% ] 46/50 VUs  2m47.6s/4m00.0s

running (2m50.0s), 47/50 VUs, 2162 complete and 0 interrupted iterations
default   [  70% ] 47/50 VUs  2m48.6s/4m00.0s

running (2m51.0s), 47/50 VUs, 2192 complete and 0 interrupted iterations
default   [  71% ] 47/50 VUs  2m49.6s/4m00.0s

running (2m52.0s), 47/50 VUs, 2220 complete and 0 interrupted iterations
default   [  71% ] 47/50 VUs  2m50.6s/4m00.0s

running (2m53.0s), 47/50 VUs, 2249 complete and 0 interrupted iterations
default   [  71% ] 47/50 VUs  2m51.6s/4m00.0s

running (2m54.0s), 48/50 VUs, 2279 complete and 0 interrupted iterations
default   [  72% ] 48/50 VUs  2m52.6s/4m00.0s

running (2m55.0s), 48/50 VUs, 2307 complete and 0 interrupted iterations
default   [  72% ] 48/50 VUs  2m53.6s/4m00.0s

running (2m56.0s), 48/50 VUs, 2337 complete and 0 interrupted iterations
default   [  73% ] 48/50 VUs  2m54.6s/4m00.0s

running (2m57.0s), 48/50 VUs, 2367 complete and 0 interrupted iterations
default   [  73% ] 48/50 VUs  2m55.6s/4m00.0s

running (2m58.0s), 49/50 VUs, 2395 complete and 0 interrupted iterations
default   [  74% ] 49/50 VUs  2m56.6s/4m00.0s

running (2m59.0s), 49/50 VUs, 2422 complete and 0 interrupted iterations
default   [  74% ] 49/50 VUs  2m57.6s/4m00.0s

running (3m00.0s), 49/50 VUs, 2452 complete and 0 interrupted iterations
default   [  74% ] 49/50 VUs  2m58.6s/4m00.0s

running (3m01.0s), 49/50 VUs, 2481 complete and 0 interrupted iterations
default   [  75% ] 49/50 VUs  2m59.6s/4m00.0s

running (3m02.0s), 50/50 VUs, 2511 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m00.6s/4m00.0s

running (3m03.0s), 50/50 VUs, 2539 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m01.6s/4m00.0s

running (3m04.0s), 49/50 VUs, 2569 complete and 0 interrupted iterations
default   [  76% ] 49/50 VUs  3m02.6s/4m00.0s

running (3m05.0s), 48/50 VUs, 2597 complete and 0 interrupted iterations
default   [  76% ] 48/50 VUs  3m03.6s/4m00.0s

running (3m06.0s), 47/50 VUs, 2625 complete and 0 interrupted iterations
default   [  77% ] 47/50 VUs  3m04.6s/4m00.0s

running (3m07.0s), 47/50 VUs, 2655 complete and 0 interrupted iterations
default   [  77% ] 47/50 VUs  3m05.6s/4m00.0s

running (3m08.0s), 46/50 VUs, 2683 complete and 0 interrupted iterations
default   [  78% ] 46/50 VUs  3m06.6s/4m00.0s

running (3m09.0s), 46/50 VUs, 2708 complete and 0 interrupted iterations
default   [  78% ] 46/50 VUs  3m07.6s/4m00.0s

running (3m10.0s), 43/50 VUs, 2738 complete and 0 interrupted iterations
default   [  79% ] 43/50 VUs  3m08.6s/4m00.0s

running (3m11.0s), 43/50 VUs, 2767 complete and 0 interrupted iterations
default   [  79% ] 43/50 VUs  3m09.6s/4m00.0s

running (3m12.0s), 42/50 VUs, 2793 complete and 0 interrupted iterations
default   [  79% ] 42/50 VUs  3m10.6s/4m00.0s

running (3m13.0s), 41/50 VUs, 2819 complete and 0 interrupted iterations
default   [  80% ] 41/50 VUs  3m11.6s/4m00.0s

running (3m14.0s), 41/50 VUs, 2847 complete and 0 interrupted iterations
default   [  80% ] 41/50 VUs  3m12.6s/4m00.0s

running (3m15.0s), 40/50 VUs, 2873 complete and 0 interrupted iterations
default   [  81% ] 40/50 VUs  3m13.6s/4m00.0s

running (3m16.0s), 39/50 VUs, 2901 complete and 0 interrupted iterations
default   [  81% ] 39/50 VUs  3m14.6s/4m00.0s

running (3m17.0s), 39/50 VUs, 2927 complete and 0 interrupted iterations
default   [  81% ] 39/50 VUs  3m15.6s/4m00.0s

running (3m18.0s), 37/50 VUs, 2953 complete and 0 interrupted iterations
default   [  82% ] 37/50 VUs  3m16.6s/4m00.0s

running (3m19.0s), 36/50 VUs, 2981 complete and 0 interrupted iterations
default   [  82% ] 36/50 VUs  3m17.6s/4m00.0s

running (3m20.0s), 35/50 VUs, 3009 complete and 0 interrupted iterations
default   [  83% ] 35/50 VUs  3m18.6s/4m00.0s

running (3m21.0s), 35/50 VUs, 3036 complete and 0 interrupted iterations
default   [  83% ] 35/50 VUs  3m19.6s/4m00.0s

running (3m22.0s), 34/50 VUs, 3065 complete and 0 interrupted iterations
default   [  84% ] 34/50 VUs  3m20.6s/4m00.0s

running (3m23.0s), 33/50 VUs, 3092 complete and 0 interrupted iterations
default   [  84% ] 33/50 VUs  3m21.6s/4m00.0s

running (3m24.0s), 32/50 VUs, 3118 complete and 0 interrupted iterations
default   [  84% ] 32/50 VUs  3m22.6s/4m00.0s

running (3m25.0s), 31/50 VUs, 3143 complete and 0 interrupted iterations
default   [  85% ] 31/50 VUs  3m23.6s/4m00.0s

running (3m26.0s), 31/50 VUs, 3168 complete and 0 interrupted iterations
default   [  85% ] 31/50 VUs  3m24.6s/4m00.0s

running (3m27.0s), 30/50 VUs, 3192 complete and 0 interrupted iterations
default   [  86% ] 30/50 VUs  3m25.6s/4m00.0s

running (3m28.0s), 29/50 VUs, 3217 complete and 0 interrupted iterations
default   [  86% ] 29/50 VUs  3m26.6s/4m00.0s

running (3m29.0s), 28/50 VUs, 3239 complete and 0 interrupted iterations
default   [  86% ] 28/50 VUs  3m27.6s/4m00.0s

running (3m30.0s), 27/50 VUs, 3263 complete and 0 interrupted iterations
default   [  87% ] 27/50 VUs  3m28.6s/4m00.0s

running (3m31.0s), 26/50 VUs, 3285 complete and 0 interrupted iterations
default   [  87% ] 26/50 VUs  3m29.6s/4m00.0s

running (3m32.0s), 25/50 VUs, 3307 complete and 0 interrupted iterations
default   [  88% ] 25/50 VUs  3m30.6s/4m00.0s

running (3m33.0s), 24/50 VUs, 3327 complete and 0 interrupted iterations
default   [  88% ] 24/50 VUs  3m31.6s/4m00.0s

running (3m34.0s), 24/50 VUs, 3344 complete and 0 interrupted iterations
default   [  89% ] 24/50 VUs  3m32.6s/4m00.0s

running (3m35.0s), 23/50 VUs, 3365 complete and 0 interrupted iterations
default   [  89% ] 23/50 VUs  3m33.6s/4m00.0s

running (3m36.0s), 22/50 VUs, 3385 complete and 0 interrupted iterations
default   [  89% ] 22/50 VUs  3m34.6s/4m00.0s

running (3m37.0s), 22/50 VUs, 3403 complete and 0 interrupted iterations
default   [  90% ] 22/50 VUs  3m35.6s/4m00.0s

running (3m38.0s), 20/50 VUs, 3421 complete and 0 interrupted iterations
default   [  90% ] 20/50 VUs  3m36.6s/4m00.0s

running (3m39.0s), 19/50 VUs, 3438 complete and 0 interrupted iterations
default   [  91% ] 19/50 VUs  3m37.6s/4m00.0s

running (3m40.0s), 19/50 VUs, 3454 complete and 0 interrupted iterations
default   [  91% ] 19/50 VUs  3m38.6s/4m00.0s

running (3m41.0s), 18/50 VUs, 3469 complete and 0 interrupted iterations
default   [  91% ] 18/50 VUs  3m39.6s/4m00.0s

running (3m42.0s), 18/50 VUs, 3485 complete and 0 interrupted iterations
default   [  92% ] 18/50 VUs  3m40.6s/4m00.0s

running (3m43.0s), 16/50 VUs, 3500 complete and 0 interrupted iterations
default   [  92% ] 16/50 VUs  3m41.6s/4m00.0s

running (3m44.0s), 16/50 VUs, 3513 complete and 0 interrupted iterations
default   [  93% ] 16/50 VUs  3m42.6s/4m00.0s

running (3m45.0s), 15/50 VUs, 3527 complete and 0 interrupted iterations
default   [  93% ] 15/50 VUs  3m43.6s/4m00.0s

running (3m46.0s), 14/50 VUs, 3539 complete and 0 interrupted iterations
default   [  94% ] 14/50 VUs  3m44.6s/4m00.0s

running (3m47.0s), 13/50 VUs, 3551 complete and 0 interrupted iterations
default   [  94% ] 13/50 VUs  3m45.6s/4m00.0s

running (3m48.0s), 12/50 VUs, 3561 complete and 0 interrupted iterations
default   [  94% ] 12/50 VUs  3m46.6s/4m00.0s

running (3m49.0s), 11/50 VUs, 3572 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  3m47.6s/4m00.0s

running (3m50.0s), 10/50 VUs, 3582 complete and 0 interrupted iterations
default   [  95% ] 10/50 VUs  3m48.6s/4m00.0s

running (3m51.0s), 09/50 VUs, 3591 complete and 0 interrupted iterations
default   [  96% ] 09/50 VUs  3m49.6s/4m00.0s

running (3m52.0s), 09/50 VUs, 3599 complete and 0 interrupted iterations
default   [  96% ] 09/50 VUs  3m50.6s/4m00.0s

running (3m53.0s), 08/50 VUs, 3607 complete and 0 interrupted iterations
default   [  96% ] 08/50 VUs  3m51.6s/4m00.0s

running (3m54.0s), 08/50 VUs, 3613 complete and 0 interrupted iterations
default   [  97% ] 08/50 VUs  3m52.6s/4m00.0s

running (3m55.0s), 07/50 VUs, 3619 complete and 0 interrupted iterations
default   [  97% ] 07/50 VUs  3m53.6s/4m00.0s

running (3m56.0s), 05/50 VUs, 3625 complete and 0 interrupted iterations
default   [  98% ] 05/50 VUs  3m54.6s/4m00.0s

running (3m57.0s), 05/50 VUs, 3629 complete and 0 interrupted iterations
default   [  98% ] 05/50 VUs  3m55.6s/4m00.0s

running (3m58.0s), 04/50 VUs, 3634 complete and 0 interrupted iterations
default   [  99% ] 04/50 VUs  3m56.6s/4m00.0s

running (3m59.0s), 03/50 VUs, 3637 complete and 0 interrupted iterations
default   [  99% ] 03/50 VUs  3m57.6s/4m00.0s

running (4m00.0s), 02/50 VUs, 3639 complete and 0 interrupted iterations
default   [  99% ] 02/50 VUs  3m58.6s/4m00.0s

running (4m01.0s), 02/50 VUs, 3641 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  3m59.6s/4m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 3643   15.087659/s
    checks_succeeded...: 99.97% 3642 out of 3643
    checks_failed......: 0.02%  1 out of 3643

    ✗ is status 201
      ↳  99% — ✓ 3642 / ✗ 1

    HTTP
    http_req_duration..............: avg=727.89ms min=4.81ms   med=676.81ms max=2s    p(90)=1.32s p(95)=1.46s
      { expected_response:true }...: avg=728.09ms min=160.19ms med=676.91ms max=2s    p(90)=1.32s p(95)=1.46s
    http_req_failed................: 0.02%  1 out of 3644
    http_reqs......................: 3644   15.091801/s

    EXECUTION
    iteration_duration.............: avg=1.73s    min=1s       med=1.67s    max=3.01s p(90)=2.32s p(95)=2.46s
    iterations.....................: 3643   15.087659/s
    vus............................: 2      min=0         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 3.5 MB 14 kB/s
    data_sent......................: 6.2 MB 26 kB/s



running (4m01.5s), 00/50 VUs, 3643 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  4m0s